app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    if @account.save
---
INSERT INTO "accounts" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "New"], ["last_name", "Account"], ["email", "nnew@gms.com"], ["created_at", "2023-05-28 09:49:33.033522"], ["updated_at", "2023-05-28 09:49:33.033522"]]

  def update
    if @account.update(account_params)
---
UPDATE "accounts" SET "email" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["email", "new@gms.com"], ["updated_at", "2023-05-28 09:53:01.906128"], ["id", 1]]