app/controllers/properties_controller.rb

INSERT INTO "properties" ("account_id", "title", "price", "rooms", "bathrooms", "address", "latitude", "longitude", "created_at", "updated_at", "fake_latitude", "fake_longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
UPDATE "properties" SET "updated_at" = $1, "fake_latitude" = $2, "fake_longitude" = $3 WHERE "properties"."id" = $4  [["updated_at", "2023-05-30 03:48:26.511175"], ["fake_latitude", 35.35823], ["fake_longitude", 132.75530099999997], ["id", 11]]
---
  def set_fake_coordinate
    if @property.latitude.present?
      @property.fake_latitude = @property.latitude + [-0.0003, -0.0002, -0.0001, 0.0001, 0.0002, 0.0003].sample
      @property.fake_longitude = @property.longitude + [-0.0003, -0.0002, -0.0001, 0.0001, 0.0002, 0.0003].sample
      @property.save

INSERT INTO "properties" ("account_id", "title", "price", "rooms", "bathrooms", "address", "latitude", "longitude", "created_at", "updated_at", "fake_latitude", "fake_longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
UPDATE "properties" SET "updated_at" = $1 WHERE "properties"."id" = $2  [["updated_at", "2023-05-30 02:33:20.541976"], ["id", 4]]
---
  def create
    @property = Property.create(property_params)
    set_fake_coordinate
    if @property.save